{
  "head": {
    "title": "Restaurant Template | Fran Aragón",
    "description": "Fran Aragón, Frontend Developer specialized in React, TypeScript, and web design. Passionate about building intuitive interfaces and innovative digital solutions for agile, high-performance environments.",
    "url": "https://www.franaragondev.com/",
    "image": "https://www.franaragondev.com/logo.png",
    "keywords": ""
  },
  "menu": {
    "home": "Home",
    "menu": "Menu",
    "gallery": "Gallery",
    "about": "About Us",
    "contact": "Contact",
    "language": "Language"
  },
  "language": {
    "es": "Spanish",
    "en": "English"
  },
  "cookies": {
    "message": "We use analytical cookies to improve the user experience and analyze site traffic. We do not store personal data. You can accept or reject their use.",
    "accept": "Accept",
    "reject": "Reject",
    "learnMore": "Learn more",
    "linkText": "Cookie Policy"
  },
  "cookiesPolicy": {
    "title": "Cookie Policy",
    "intro": "This website uses analytical cookies to understand how users interact with the site, using tools such as Google Analytics and Search Console.",
    "whatAreCookiesTitle": "What are cookies?",
    "whatAreCookies": "Cookies are small files stored on your device to improve your experience on the website.",
    "typesTitle": "Types of cookies we use",
    "typesList": [
      "Analytical cookies: Allow us to collect anonymous data about site usage to improve performance and user experience."
    ],
    "manageTitle": "Cookie management",
    "manageText": "You can accept or reject analytical cookies via the banner or through your browser settings.",
    "personalDataTitle": "Personal data",
    "personalDataTextPart1": "We do not collect or store personal data through cookies or forms on this site.",
    "personalDataTextPart2": "",
    "privacyPolicyLinkText": "Privacy Policy",
    "changesTitle": "Policy changes",
    "changesText": "We may update this policy occasionally. Please review this page to stay informed.",
    "lastUpdated": "Last updated: June 2025"
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "intro": "This website does not store personal user data. We only use external tools like Google Analytics and Search Console to analyze metrics and improve the experience.",
    "sections": [
      {
        "title": "1. Personal data",
        "text": "We do not collect or store personal data through this website."
      },
      {
        "title": "2. Analytical tools",
        "text": "We use Google Analytics and Search Console to measure site traffic and behavior, always respecting user privacy through data anonymization."
      },
      {
        "title": "3. Contact",
        "text": "If you want to contact me, you can do so by email. We do not store your information or track you."
      },
      {
        "title": "4. Rights",
        "text": "Since we do not store personal data, requests for access, correction, or deletion do not apply."
      },
      {
        "title": "5. Policy changes",
        "text": "We may update this policy at any time. We recommend reviewing it periodically."
      }
    ],
    "lastUpdated": "Last updated: June 2025",
    "cookiesLinkText": "Cookie Policy"
  },
  "termsOfUse": {
    "title": "Terms of Use",
    "intro": "By using this website or application, you agree to these Terms of Use and our ",
    "sections": [
      {
        "title": "1. Acceptance",
        "text": "Accessing or using the service constitutes acceptance of these Terms and the Privacy Policy available on this site."
      },
      {
        "title": "2. Permitted use",
        "text": "You must not interfere with the operation of the service or use it for unlawful purposes. We may suspend or restrict access in case of misuse."
      },
      {
        "title": "3. Changes",
        "text": "We may update these Terms. Continued use after changes means you accept the updated Terms."
      },
      {
        "title": "4. Contact",
        "text": "For questions about these Terms, contact us at: info@email.com. Postal address: Avenida España, Estepona (Málaga), Spain."
      }
    ],
    "lastUpdated": "Last updated: August 2025"
  },
  "footer": {
    "left": "2025 Template Restaurant. All rights reserved.",
    "right": "Website provided by <link>Fran Aragón</link>."
  },
  "notFound": {
    "title": "Page not found",
    "subtitle": "Sorry, we couldn't find the page you're looking for.",
    "goHome": "Go back home"
  },
  "experience": {
    "title": "Experience",
    "adidas": {
      "title": "Software Developer",
      "period": "July 2022 - September 2025",
      "point1": "Worked in the Innovation team, contributing to digital solutions that supported adidas’s product creation workflows and internal applications for managing athlete data.",
      "point2": "Contributed to the Carry Over & Color Up Tool (COCU), focusing on building a scalable frontend and collaborating on the UI with business stakeholders.",
      "point3": "Built modern web apps with JavaScript, TypeScript, and ReactJS, prioritizing maintainability and performance.",
      "point4": "Developed internal applications from scratch with React & Vite, supporting both initial design and implementation.",
      "point5": "Collaborated closely with cross-functional teams (design, backend, business units) to ensure product success and continuous development.",
      "point6": "Applied best practices in testing (Jest, React Testing Library), accessibility, and responsive design."
    },
    "cei": {
      "title": "Fullstack Development & Web Design Instructor",
      "period": "January 2022 - July 2022",
      "point1": "Taught Web Design (HTML5, CSS3, jQuery, JavaScript) and Fullstack Development (JavaScript, PHP, MySQL).",
      "point2": "Designed practical exercises and projects focused on real-world scenarios, plus individual mentoring to support job readiness."
    },
    "gransliving": {
      "title": "Frontend Developer · Web Designer",
      "period": "September 2021 - November 2022",
      "point1": "Migrated the company’s WordPress site to a modern React.js application with Next.js, improving performance and scalability.",
      "point2": "Designed and implemented the new UI with Figma in collaboration with the team; optimized responsive UX to current UI/UX standards."
    }
  },
  "projects": {
    "homestocker": {
      "title": "HomeStocker",
      "description": "Easily control and organize your home pantry stock. Save money, reduce waste, and avoid unnecessary purchases.",
      "url": "https://homestocker.app/en"
    },
    "cdestepona": {
      "title": "CD Estepona Fans",
      "description": "News, live matches, and exclusive content for Club Deportivo Estepona fans.",
      "url": "https://www.cdesteponafans.com/en"
    },
    "sportsteam-template": {
      "title": "SportsTeam Template",
      "description": "Website template for sports teams, mainly football, but adaptable to other sports.",
      "url": "https://www.sportsteamtemplate.com/en"
    },
    "viewProject": "View project",
    "title": "Projects"
  },
  "about": {
    "title": "About Me",
    "description": "I'm Fran Aragón, a software developer specialized in frontend.<br /><br />Until September 2025 I worked at adidas in the Innovation team, where I built digital solutions focused on performance and scalability, as well as internal applications for athlete data management.<br /><br />In my personal projects I use modern tools like React, TypeScript, Next.js, and Tailwind.<br /><br />I'm passionate about designing, building, and optimizing web experiences with a strong focus on best practices, performance, and accessibility.",
    "viewCV": "View CV"
  },
  "contact": {
    "title": "Contact",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Send message",
    "success": "Message sent successfully",
    "error": "There was an error sending the message",
    "phone": "Phone numbers",
    "emailLabel": "Email",
    "social": "Social media"
  }
}