{
  "head": {
    "title": "Fran Arag贸n | Frontend Developer",
    "description": "Fran Arag贸n, Frontend Developer, specialized in React, TypeScript, and web design. Passionate about creating intuitive interfaces and innovative digital solutions for agile, high-performance environments.",
    "url": "https://www.franaragondev.com/",
    "image": "https://www.franaragondev.com/images/logo.png",
    "keywords": "frontend developer, web designer, react, typescript, frontend, web design, user interfaces, UX/UI, web programmer, frontend development"
  },
  "menu": {
    "home": "Home",
    "experience": "Experience",
    "about": "About Me",
    "contact": "Contact",
    "language": "Language"
  },
  "language": {
    "es": "Spanish",
    "en": "English"
  },
  "cookies": {
    "message": "We use analytical cookies to improve the user experience and analyze site traffic. We do not store personal data. You can accept or reject their use.",
    "accept": "Accept",
    "reject": "Reject",
    "learnMore": "Learn more",
    "linkText": "Cookie Policy"
  },
  "cookiesPolicy": {
    "title": "Cookie Policy",
    "intro": "This website uses analytical cookies to understand how users interact with the site, using tools such as Google Analytics and Search Console.",
    "whatAreCookiesTitle": "What are cookies?",
    "whatAreCookies": "Cookies are small files stored on your device to improve your experience on the website.",
    "typesTitle": "Types of cookies we use",
    "typesList": [
      "Analytical cookies: Allow us to collect anonymous data about site usage to improve its performance and user experience."
    ],
    "manageTitle": "Cookie management",
    "manageText": "You can accept or reject analytical cookies via the banner or through your browser settings.",
    "personalDataTitle": "Personal data",
    "personalDataTextPart1": "We do not collect or store personal data through cookies or forms on this site.",
    "personalDataTextPart2": "",
    "privacyPolicyLinkText": "Privacy Policy",
    "changesTitle": "Policy changes",
    "changesText": "We may update this policy occasionally. Please review this page to stay informed.",
    "lastUpdated": "Last updated: June 2025"
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "intro": "This website does not store personal user data. We only use external tools like Google Analytics and Search Console to analyze metrics and improve the experience.",
    "sections": [
      {
        "title": "1. Personal data",
        "text": "We do not collect or store personal data through this website."
      },
      {
        "title": "2. Analytical tools",
        "text": "We use Google Analytics and Search Console to measure site traffic and behavior, always respecting user privacy through data anonymization."
      },
      {
        "title": "3. Contact",
        "text": "If you want to contact me, you can do so by email. We do not store your information or track you."
      },
      {
        "title": "4. Rights",
        "text": "Since we do not store personal data, requests for access, correction, or deletion do not apply."
      },
      {
        "title": "5. Policy changes",
        "text": "We may update this policy at any time. We recommend reviewing it periodically."
      }
    ],
    "lastUpdated": "Last updated: June 2025",
    "cookiesLinkText": "Cookie Policy"
  },
  "footer": {
    "center": "2025 Fran Arag贸n. Todos los derechos reservados."
  },
  "experience": {
    "title": "Experience",
    "adidas": {
      "title": "Software Developer",
      "period": "July 2022 - Present",
      "point1": "Created React-based applications from scratch, leading from design to development.",
      "point2": "Developed web applications using JavaScript or TypeScript with ReactJS.",
      "point3": "Collaborated with another department on the COCU (Carry Over & Color Up Tool) project: helped build the frontend application from scratch with React (Vite framework) and designed the user interface."
    },
    "cei": {
      "title": "Fullstack Development & Web Design Instructor",
      "period": "January 2022 - July 2022",
      "point1": "Instructor for the web design course using HTML5, CSS3, jQuery, and JavaScript.",
      "point2": "Instructor for the fullstack development course using JavaScript, PHP, and MySQL."
    },
    "gransliving": {
      "title": "Frontend Developer 路 Web Designer",
      "period": "September 2021 - November 2022",
      "point1": "Converted a Wordpress site into a React.js application with NextJS.",
      "point2": "Designed the new web app layout in Figma and implemented it."
    }
  }
}
