{
  "head": {
    "title": "Fran Aragón | Frontend Developer",
    "description": "Fran Aragón, Frontend Developer, specialized in React, TypeScript, and web design. Passionate about creating intuitive interfaces and innovative digital solutions for agile, high-performance environments.",
    "url": "https://www.franaragondev.com/",
    "image": "https://www.franaragondev.com/logo.png",
    "keywords": "frontend developer, web designer, react, typescript, frontend, web design, user interfaces, UX/UI, web programmer, frontend development"
  },
  "menu": {
    "projects": "Projects",
    "experience": "Experience",
    "about": "About Me",
    "contact": "Contact",
    "language": "Language"
  },
  "language": {
    "es": "Spanish",
    "en": "English"
  },
  "cookies": {
    "message": "We use analytical cookies to improve the user experience and analyze site traffic. We do not store personal data. You can accept or reject their use.",
    "accept": "Accept",
    "reject": "Reject",
    "learnMore": "Learn more",
    "linkText": "Cookie Policy"
  },
  "cookiesPolicy": {
    "title": "Cookie Policy",
    "intro": "This website uses analytical cookies to understand how users interact with the site, using tools such as Google Analytics and Search Console.",
    "whatAreCookiesTitle": "What are cookies?",
    "whatAreCookies": "Cookies are small files stored on your device to improve your experience on the website.",
    "typesTitle": "Types of cookies we use",
    "typesList": [
      "Analytical cookies: Allow us to collect anonymous data about site usage to improve its performance and user experience."
    ],
    "manageTitle": "Cookie management",
    "manageText": "You can accept or reject analytical cookies via the banner or through your browser settings.",
    "personalDataTitle": "Personal data",
    "personalDataTextPart1": "We do not collect or store personal data through cookies or forms on this site.",
    "personalDataTextPart2": "",
    "privacyPolicyLinkText": "Privacy Policy",
    "changesTitle": "Policy changes",
    "changesText": "We may update this policy occasionally. Please review this page to stay informed.",
    "lastUpdated": "Last updated: June 2025"
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "intro": "This website does not store personal user data. We only use external tools like Google Analytics and Search Console to analyze metrics and improve the experience.",
    "sections": [
      {
        "title": "1. Personal data",
        "text": "We do not collect or store personal data through this website."
      },
      {
        "title": "2. Analytical tools",
        "text": "We use Google Analytics and Search Console to measure site traffic and behavior, always respecting user privacy through data anonymization."
      },
      {
        "title": "3. Contact",
        "text": "If you want to contact me, you can do so by email. We do not store your information or track you."
      },
      {
        "title": "4. Rights",
        "text": "Since we do not store personal data, requests for access, correction, or deletion do not apply."
      },
      {
        "title": "5. Policy changes",
        "text": "We may update this policy at any time. We recommend reviewing it periodically."
      }
    ],
    "lastUpdated": "Last updated: June 2025",
    "cookiesLinkText": "Cookie Policy"
  },
  "footer": {
    "center": "2025 Fran Aragón. All rights reserved."
  },
  "experience": {
    "title": "Experience",
    "adidas": {
      "title": "Software Developer",
      "period": "July 2022 - Present",
      "point1": "Developed applications from scratch using React, leading both design and implementation phases.",
      "point2": "Built modern web applications with JavaScript or TypeScript using ReactJS.",
      "point3": "Cross-department collaboration on the COCU (Carry Over & Color Up Tool) project: built the frontend with React (Vite framework) and designed the user interface."
    },
    "cei": {
      "title": "Fullstack Development & Web Design Instructor",
      "period": "January 2022 - July 2022",
      "point1": "Instructor for the web design course, teaching HTML5, CSS3, jQuery, and JavaScript.",
      "point2": "Instructor for the fullstack development course using JavaScript, PHP, and MySQL."
    },
    "gransliving": {
      "title": "Frontend Developer · Web Designer",
      "period": "September 2021 - November 2022",
      "point1": "Migrated a WordPress website into a modern React.js web application with Next.js.",
      "point2": "Designed and implemented the new interface using Figma."
    }
  },
  "projects": {
    "homestocker": {
      "title": "HomeStocker",
      "description": "Easily control and organize the stock of your pantry at home. Save money, reduce waste, and avoid unnecessary purchases.",
      "url": "https://homestocker.app/en"
    },
    "cdestepona": {
      "title": "CD Estepona Fans",
      "description": "News, live matches and exclusive content for fans of Club Deportivo Estepona.",
      "url": "https://www.cdesteponafans.com/en"
    },
    "sportsteam-template": {
      "title": "SportsTeam Template",
      "description": "Website template for sports teams, mainly football, but adaptable to other sports.",
      "url": "https://www.sportsteamtemplate.com/en"
    },
    "viewProject": "View project",
    "title": "Projects"
  },
  "about": {
    "title": "About Me",
    "description": "I'm Fran Aragón, a software developer specialized in frontend.<br /><br />I currently work at adidas in the innovation team, where I build digital solutions focused on performance and scalability.<br /><br />While my current role involves corporate technologies, I use modern tools like React, TypeScript, Next.js, and Tailwind in my personal projects.<br /><br />I'm passionate about designing, building, and optimizing web experiences with a strong focus on best practices, performance, and accessibility.",
    "viewCV": "View CV"
  },
  "contact": {
    "title": "Contact",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Send message",
    "success": "Message sent successfully",
    "error": "There was an error sending the message",
    "phone": "Phone numbers",
    "emailLabel": "Email",
    "social": "Social media"
  }
}
