{
  "head": {
    "title": "Fran Aragón | Desarrollador Frontend React, TypeScript y Next.js",
    "description": "Fran Aragón, desarrollador frontend especializado en React, TypeScript y Next.js. Apasionado por crear interfaces web escalables, intuitivas y accesibles, aplicando buenas prácticas de UX/UI y rendimiento en aplicaciones modernas.",
    "url": "https://www.franaragondev.com/",
    "image": "https://www.franaragondev.com/logo.png",
    "keywords": "desarrollador frontend, React, TypeScript, Next.js, Tailwind CSS, interfaces web, UX/UI, aplicaciones web escalables, desarrollo frontend, diseño web, accesibilidad web, programador web"
  },
  "menu": {
    "projects": "Proyectos",
    "experience": "Experiencia",
    "about": "Sobre Mi",
    "contact": "Contacto",
    "language": "Idioma"
  },
  "language": {
    "es": "Español",
    "en": "Inglés"
  },
  "cookies": {
    "message": "Usamos cookies analíticas para mejorar la experiencia del usuario y analizar el tráfico del sitio. No almacenamos datos personales. Puedes aceptar o rechazar su uso.",
    "accept": "Aceptar",
    "reject": "Rechazar",
    "learnMore": "Saber más",
    "linkText": "Política de Cookies"
  },
  "cookiesPolicy": {
    "title": "Política de Cookies",
    "intro": "Este sitio web utiliza cookies analíticas para entender cómo interactúan los usuarios con el sitio, mediante herramientas como Google Analytics y Search Console.",
    "whatAreCookiesTitle": "¿Qué son las cookies?",
    "whatAreCookies": "Las cookies son pequeños archivos que se almacenan en tu dispositivo para mejorar tu experiencia en el sitio web.",
    "typesTitle": "Tipos de cookies que usamos",
    "typesList": [
      "Cookies analíticas: Nos permiten recopilar datos anónimos sobre el uso del sitio para mejorar su rendimiento y experiencia."
    ],
    "manageTitle": "Gestión de cookies",
    "manageText": "Puedes aceptar o rechazar las cookies analíticas mediante el banner o a través de la configuración de tu navegador.",
    "personalDataTitle": "Datos personales",
    "personalDataTextPart1": "No recopilamos ni almacenamos datos personales a través de cookies ni formularios en este sitio.",
    "personalDataTextPart2": "",
    "privacyPolicyLinkText": "Política de Privacidad",
    "changesTitle": "Cambios en la política",
    "changesText": "Podemos actualizar esta política ocasionalmente. Revisa esta página para estar informado.",
    "lastUpdated": "Última actualización: junio 2025"
  },
  "privacyPolicy": {
    "title": "Política de Privacidad",
    "intro": "En este sitio web no almacenamos datos personales de los usuarios. Solo utilizamos herramientas externas como Google Analytics y Search Console para analizar métricas y mejorar la experiencia.",
    "sections": [
      {
        "title": "1. Datos personales",
        "text": "No recopilamos ni almacenamos datos personales a través de este sitio web."
      },
      {
        "title": "2. Herramientas analíticas",
        "text": "Utilizamos Google Analytics y Search Console para medir el tráfico y comportamiento del sitio, siempre respetando la privacidad del usuario mediante el anonimato de los datos."
      },
      {
        "title": "3. Contacto",
        "text": "Si deseas contactarme, puedes hacerlo por correo electrónico. No almacenamos tu información ni hacemos seguimiento."
      },
      {
        "title": "4. Derechos",
        "text": "Dado que no almacenamos datos personales, no aplican solicitudes de acceso, rectificación o eliminación."
      },
      {
        "title": "5. Cambios en la política",
        "text": "Podemos actualizar esta política en cualquier momento. Te recomendamos revisarla periódicamente."
      }
    ],
    "lastUpdated": "Última actualización: junio 2025",
    "cookiesLinkText": "Política de Cookies"
  },
  "footer": {
    "center": "2025 Fran Aragón. Todos los derechos reservados."
  },
  "experience": {
    "title": "Experiencia",
    "adidas": {
      "title": "Desarrollador de Software",
      "period": "julio 2022 - septiembre 2025",
      "point1": "Trabajo en el equipo de Innovación, contribuyendo a soluciones digitales que soportan los flujos de creación de producto de adidas y aplicaciones internas para la gestión de datos de atletas.",
      "point2": "Contribución al desarrollo del Carry Over & Color Up Tool (COCU), centrado en construir un frontend escalable y en el diseño de la interfaz en colaboración con stakeholders de negocio.",
      "point3": "Desarrollo de aplicaciones web modernas con JavaScript, TypeScript y ReactJS, priorizando mantenibilidad y rendimiento.",
      "point4": "Creación de aplicaciones internas desde cero con React y Vite, cubriendo diseño inicial e implementación.",
      "point5": "Colaboración estrecha con equipos multifuncionales (diseño, backend, negocio) para asegurar el éxito y la evolución continua de las aplicaciones.",
      "point6": "Aplicación de buenas prácticas de testing (Jest, React Testing Library), accesibilidad y diseño responsive."
    },
    "cei": {
      "title": "Profesor de Desarrollo Fullstack y Diseño Web",
      "period": "enero 2022 - julio 2022",
      "point1": "Docente del curso de diseño web, impartiendo HTML5, CSS3, jQuery y JavaScript.",
      "point2": "Docente del curso de desarrollo fullstack con JavaScript, PHP y MySQL.",
      "point3": "Diseño de prácticas y proyectos con enfoque real para fortalecer habilidades técnicas y de resolución de problemas.",
      "point4": "Mentoría individual orientada a inserción laboral y crecimiento profesional."
    },
    "gransliving": {
      "title": "Desarrollador Frontend · Diseñador Web",
      "period": "septiembre 2021 - noviembre 2022",
      "point1": "Migración de WordPress a una aplicación moderna con React.js y Next.js, mejorando rendimiento y escalabilidad.",
      "point2": "Diseño e implementación de la nueva interfaz usando Figma en coordinación con el equipo.",
      "point3": "Optimización de responsive y experiencia de usuario según estándares UI/UX actuales."
    },
    "solutia": {
      "title": "Desarrollador Frontend",
      "period": "noviembre 2025 - actualidad",
      "point1": "Me encargo del desarrollo frontend de productos web internos y para clientes, utilizando React y TypeScript, participando en decisiones de UI/UX y garantizando la coherencia entre componentes y patrones de interacción.",
      "point2": "Responsable de la arquitectura de componentes, la alineación del diseño, la optimización del rendimiento y la integración con los servicios de backend.",
      "point3": "Trabajo en estrecha colaboración con desarrolladores, diseñadores y stakeholders para crear interfaces escalables, mantenibles y centradas en el usuario, con especial atención al rendimiento y la accesibilidad."
    }
  },
  "projects": {
    "homestocker": {
      "title": "HomeStocker",
      "description": "Controla y organiza el stock de tu despensa en casa fácilmente. Ahorra dinero, reduce desperdicios y evita compras innecesarias.",
      "url": "https://homestocker.app/"
    },
    "cdestepona": {
      "title": "CD Estepona Fans",
      "description": "Noticias, partidos en directo y contenido exclusivo para los aficionados del Club Deportivo Estepona.",
      "url": "https://www.cdesteponafans.com/"
    },
    "sportsteam-template": {
      "title": "SportsTeam Template",
      "description": "Plantilla web para equipos deportivos, principalmente fútbol, pero adaptable a otros deportes.",
      "url": "https://www.sportsteamtemplate.com"
    },
    "business-template": {
      "title": "Business Template",
      "description": "Plantilla moderna y elegante para negocios, agencias o freelancers, con un vídeo hero profesional y animaciones fluidas.",
      "url": "https://businesstemplate.franaragondev.com/"
    },
    "restaurant-template": {
      "title": "Restaurant Template",
      "description": "Plantilla web para restaurantes con un vídeo hero dinámico, secciones de menú y un diseño elegante y responsive.",
      "url": "https://restaurant-template.franaragondev.com/"
    },
    "viewProject": "Ver proyecto",
    "title": "Proyectos"
  },
  "about": {
    "title": "Sobre mí",
    "description": "Soy Fran Aragón, desarrollador frontend especializado en crear experiencias web escalables, rápidas y accesibles. Actualmente trabajo en Solutia, donde lidero el desarrollo de aplicaciones internas y orientadas al cliente, implementando soluciones eficientes y colaborando estrechamente con diseñadores y equipos de producto.<br /><br />Anteriormente formé parte del equipo de innovación de adidas, desarrollando aplicaciones internas para la gestión de datos de atletas y optimizando procesos digitales con enfoque en rendimiento y fiabilidad.<br /><br />En mis proyectos personales y profesionales utilizo tecnologías modernas como React, TypeScript, Next.js y Tailwind, aplicando siempre buenas prácticas de desarrollo, accesibilidad y experiencia de usuario.",
    "viewCV": "Ver CV"
  },
  "contact": {
    "title": "Contacto",
    "name": "Nombre",
    "email": "Correo electrónico",
    "message": "Mensaje",
    "submit": "Enviar mensaje",
    "success": "Mensaje enviado correctamente",
    "error": "Hubo un error al enviar el mensaje",
    "phone": "Teléfonos",
    "emailLabel": "Email",
    "social": "Redes"
  }
}